zephyrproject-rtos/hal_microchip/pic32c/pic32cm_jh/pic32cm_jh01/include/pic32cm1216jh01048.h
#define DRAM_SIZE                      _UINT32_(0x00004000)    /*   16kB Memory segment type: ram */
#define HPB0_SIZE                      _UINT32_(0x00004000)    /*   16kB Memory segment type: io */
#define HPB1_SIZE                      _UINT32_(0x00010000)    /*   64kB Memory segment type: io */
#define HPB2_SIZE                      _UINT32_(0x00008000)    /*   32kB Memory segment type: io */
#define HPB3_SIZE                      _UINT32_(0x00001800)    /*    6kB Memory segment type: io */
#define DIVAS_SIZE                     _UINT32_(0x00000020)    /*    0kB Memory segment type: io */
#define PPB_SIZE                       _UINT32_(0x00100000)    /* 1024kB Memory segment type: io */

#define FLASH_ADDR                     _UINT32_(0x00000000)    /* FLASH base address (type: flash)*/
#define CAL_ADDR                       _UINT32_(0x00800000)    /* CAL base address (type: fuses)*/
#define LOCKBIT_ADDR                   _UINT32_(0x00802000)    /* LOCKBIT base address (type: fuses)*/
#define OTP1_ADDR                      _UINT32_(0x00806000)    /* OTP1 base address (type: fuses)*/
#define OTP2_ADDR                      _UINT32_(0x00806008)    /* OTP2 base address (type: fuses)*/
#define OTP3_ADDR                      _UINT32_(0x00806010)    /* OTP3 base address (type: fuses)*/
#define OTP4_ADDR                      _UINT32_(0x00806018)    /* OTP4 base address (type: fuses)*/
#define OTP5_ADDR                      _UINT32_(0x00806020)    /* OTP5 base address (type: fuses)*/
#define TEMP_LOG_ADDR                  _UINT32_(0x00806030)    /* TEMP_LOG base address (type: fuses)*/
#define USER_PAGE_ADDR                 _UINT32_(0x00804000)    /* USER_PAGE base address (type: user_page)*/
#define DATAFLASH_ADDR                 _UINT32_(0x00400000)    /* DATAFLASH base address (type: flash)*/
#define DRAM_ADDR                      _UINT32_(0x20000000)    /* DRAM base address (type: ram)*/
#define HPB0_ADDR                      _UINT32_(0x40000000)    /* HPB0 base address (type: io)*/
#define HPB1_ADDR                      _UINT32_(0x41000000)    /* HPB1 base address (type: io)*/
#define HPB2_ADDR                      _UINT32_(0x42000000)    /* HPB2 base address (type: io)*/
#define HPB3_ADDR                      _UINT32_(0x43000000)    /* HPB3 base address (type: io)*/
#define DIVAS_ADDR                     _UINT32_(0x48000000)    /* DIVAS base address (type: io)*/
#define PPB_ADDR                       _UINT32_(0xe0000000)    /* PPB base address (type: io)*/

/* ************************************************************************** */
/*                  DEVICE SIGNATURES FOR PIC32CM1216JH01048                  */
/* ************************************************************************** */
#define CHIP_DSU_DID                   _UINT32_(0X1106100A)

/* ************************************************************************** */
/*               ELECTRICAL DEFINITIONS FOR PIC32CM1216JH01048                */
/* ************************************************************************** */

/* ************************************************************************** */
/*                  Event Generator IDs for C32CM1216JH01048                  */
/* ************************************************************************** */
#define EVENT_ID_GEN_RTC_PERD                             1 /* ID for RTC event generator PERD */
#define EVENT_ID_GEN_OSCCTRL_XOSC_FAIL                    3 /* ID for OSCCTRL event generator XOSC_FAIL */
#define EVENT_ID_GEN_OSC32KCTRL_XOSC32K_FAIL              4 /* ID for OSC32KCTRL event generator XOSC32K_FAIL */
#define EVENT_ID_GEN_RTC_CMP_0                            5 /* ID for RTC event generator CMP_0 */
#define EVENT_ID_GEN_RTC_CMP_1                            6 /* ID for RTC event generator CMP_1 */
#define EVENT_ID_GEN_RTC_OVF                              7 /* ID for RTC event generator OVF */
#define EVENT_ID_GEN_RTC_PER_0                            8 /* ID for RTC event generator PER_0 */
#define EVENT_ID_GEN_RTC_PER_1                            9 /* ID for RTC event generator PER_1 */
#define EVENT_ID_GEN_RTC_PER_2                           10 /* ID for RTC event generator PER_2 */
#define EVENT_ID_GEN_RTC_PER_3                           11 /* ID for RTC event generator PER_3 */
#define EVENT_ID_GEN_RTC_PER_4                           12 /* ID for RTC event generator PER_4 */
#define EVENT_ID_GEN_RTC_PER_5                           13 /* ID for RTC event generator PER_5 */
#define EVENT_ID_GEN_RTC_PER_6                           14 /* ID for RTC event generator PER_6 */
#define EVENT_ID_GEN_RTC_PER_7                           15 /* ID for RTC event generator PER_7 */
#define EVENT_ID_GEN_EIC_EXTINT_0                        16 /* ID for EIC event generator EXTINT_0 */
#define EVENT_ID_GEN_EIC_EXTINT_1                        17 /* ID for EIC event generator EXTINT_1 */
#define EVENT_ID_GEN_EIC_EXTINT_2                        18 /* ID for EIC event generator EXTINT_2 */
#define EVENT_ID_GEN_EIC_EXTINT_3                        19 /* ID for EIC event generator EXTINT_3 */
#define EVENT_ID_GEN_EIC_EXTINT_4                        20 /* ID for EIC event generator EXTINT_4 */
#define EVENT_ID_GEN_EIC_EXTINT_5                        21 /* ID for EIC event generator EXTINT_5 */
#define EVENT_ID_GEN_EIC_EXTINT_6                        22 /* ID for EIC event generator EXTINT_6 */
#define EVENT_ID_GEN_EIC_EXTINT_7                        23 /* ID for EIC event generator EXTINT_7 */
#define EVENT_ID_GEN_EIC_EXTINT_8                        24 /* ID for EIC event generator EXTINT_8 */
#define EVENT_ID_GEN_EIC_EXTINT_9                        25 /* ID for EIC event generator EXTINT_9 */
#define EVENT_ID_GEN_EIC_EXTINT_10                       26 /* ID for EIC event generator EXTINT_10 */
#define EVENT_ID_GEN_EIC_EXTINT_11                       27 /* ID for EIC event generator EXTINT_11 */
#define EVENT_ID_GEN_EIC_EXTINT_12                       28 /* ID for EIC event generator EXTINT_12 */
#define EVENT_ID_GEN_EIC_EXTINT_13                       29 /* ID for EIC event generator EXTINT_13 */
#define EVENT_ID_GEN_EIC_EXTINT_14                       30 /* ID for EIC event generator EXTINT_14 */
#define EVENT_ID_GEN_EIC_EXTINT_15                       31 /* ID for EIC event generator EXTINT_15 */
#define EVENT_ID_GEN_DMAC_CH_0                           32 /* ID for DMAC event generator CH_0 */
#define EVENT_ID_GEN_DMAC_CH_1                           33 /* ID for DMAC event generator CH_1 */
#define EVENT_ID_GEN_DMAC_CH_2                           34 /* ID for DMAC event generator CH_2 */
#define EVENT_ID_GEN_DMAC_CH_3                           35 /* ID for DMAC event generator CH_3 */
#define EVENT_ID_GEN_TC0_OVF                             53 /* ID for TC0 event generator OVF */
#define EVENT_ID_GEN_TC0_MC_0                            54 /* ID for TC0 event generator MC_0 */
#define EVENT_ID_GEN_TC0_MC_1                            55 /* ID for TC0 event generator MC_1 */
#define EVENT_ID_GEN_TC1_OVF                             56 /* ID for TC1 event generator OVF */
#define EVENT_ID_GEN_TC1_MC_0                            57 /* ID for TC1 event generator MC_0 */
#define EVENT_ID_GEN_TC1_MC_1                            58 /* ID for TC1 event generator MC_1 */
#define EVENT_ID_GEN_TC2_OVF                             59 /* ID for TC2 event generator OVF */
#define EVENT_ID_GEN_TC2_MC_0                            60 /* ID for TC2 event generator MC_0 */
#define EVENT_ID_GEN_TC2_MC_1                            61 /* ID for TC2 event generator MC_1 */
#define EVENT_ID_GEN_TC3_OVF                             62 /* ID for TC3 event generator OVF */
#define EVENT_ID_GEN_TC3_MC_0                            63 /* ID for TC3 event generator MC_0 */
#define EVENT_ID_GEN_TC3_MC_1                            64 /* ID for TC3 event generator MC_1 */
#define EVENT_ID_GEN_TC4_OVF                             65 /* ID for TC4 event generator OVF */
#define EVENT_ID_GEN_TC4_MC_0                            66 /* ID for TC4 event generator MC_0 */
#define EVENT_ID_GEN_TC4_MC_1                            67 /* ID for TC4 event generator MC_1 */
#define EVENT_ID_GEN_ADC0_RESRDY                         68 /* ID for ADC0 event generator RESRDY */
#define EVENT_ID_GEN_ADC0_WINMON                         69 /* ID for ADC0 event generator WINMON */
#define EVENT_ID_GEN_AC_COMP_0                           72 /* ID for AC event generator COMP_0 */
#define EVENT_ID_GEN_AC_COMP_1                           73 /* ID for AC event generator COMP_1 */
#define EVENT_ID_GEN_AC_WIN_0                            76 /* ID for AC event generator WIN_0 */
#define EVENT_ID_GEN_PAC_ACCERR                          85 /* ID for PAC event generator ACCERR */

/* ************************************************************************** */
/*                    Event User IDs for C32CM1216JH01048                     */
/* ************************************************************************** */
#define EVENT_ID_USER_PORT_EV_0                           1 /* ID for PORT event user EV_0 */
#define EVENT_ID_USER_PORT_EV_1                           2 /* ID for PORT event user EV_1 */
#define EVENT_ID_USER_PORT_EV_2                           3 /* ID for PORT event user EV_2 */
#define EVENT_ID_USER_PORT_EV_3                           4 /* ID for PORT event user EV_3 */
#define EVENT_ID_USER_DMAC_CH_0                           5 /* ID for DMAC event user CH_0 */
#define EVENT_ID_USER_DMAC_CH_1                           6 /* ID for DMAC event user CH_1 */
#define EVENT_ID_USER_DMAC_CH_2                           7 /* ID for DMAC event user CH_2 */
#define EVENT_ID_USER_DMAC_CH_3                           8 /* ID for DMAC event user CH_3 */
#define EVENT_ID_USER_TC0_EVU                            23 /* ID for TC0 event user EVU */
#define EVENT_ID_USER_TC1_EVU                            24 /* ID for TC1 event user EVU */
#define EVENT_ID_USER_TC2_EVU                            25 /* ID for TC2 event user EVU */
#define EVENT_ID_USER_TC3_EVU                            26 /* ID for TC3 event user EVU */
#define EVENT_ID_USER_TC4_EVU                            27 /* ID for TC4 event user EVU */
#define EVENT_ID_USER_ADC0_START                         28 /* ID for ADC0 event user START */
#define EVENT_ID_USER_ADC0_SYNC                          29 /* ID for ADC0 event user SYNC */
#define EVENT_ID_USER_AC_SOC_0                           32 /* ID for AC event user SOC_0 */
#define EVENT_ID_USER_AC_SOC_1                           33 /* ID for AC event user SOC_1 */
#define EVENT_ID_USER_MTB_START                          43 /* ID for MTB event user START */
#define EVENT_ID_USER_MTB_STOP                           44 /* ID for MTB event user STOP */

#ifdef __cplusplus
}
#endif

#endif /* _PIC32CM1216JH01048_H_ */

